app/controllers/elo_timestamps_controller.rb

    def create
        @elo_timestamp = EloTimestamp.new(elo_timestamp_params)
        if @elo_timestamp.save
---
INSERT INTO "elo_timestamps" ("elo", "summoner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["elo", 20], ["summoner_id", 1], ["created_at", "2022-12-06 04:04:23.143126"], ["updated_at", "2022-12-06 04:04:23.143126"]]