app/controllers/games_controller.rb

    def create
        @game = Game.new(game_params)
        if @game.save
---
INSERT INTO "games" ("champ", "kills", "deaths", "assist", "gold", "damage", "score", "summoner_id", "created_at", "updated_at", "won", "game_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"