app/controllers/summoners_controller.rb

SELECT "summoners".* FROM "summoners"
---
    def index
        @summoners = Summoner.all

INSERT INTO "summoners" ("name", "summoner_name", "created_at", "updated_at", "gg_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "cesar antonio madera garces"], ["summoner_name", "XDarkCROWNXxX"], ["created_at", "2022-12-07 14:43:07.963013"], ["updated_at", "2022-12-07 14:43:07.963013"], ["gg_id", "asdasd"]]
---
    def create
        @summoner = Summoner.new(summoner_params)
        if @summoner.save